zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for TSI
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_TSI.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for TSI
 *
 * CMSIS Peripheral Access Layer for TSI
 */

#if !defined(PERI_TSI_H_)
#define PERI_TSI_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TSI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSI_Peripheral_Access_Layer TSI Peripheral Access Layer
 * @{
 */

/** TSI - Register Layout Typedef */
typedef struct {
  union {                                          /* offset: 0x0 */
    __IO uint32_t CONFIG_MUTUAL;                     /**< TSI CONFIG register (TSI_CONFIG) for mutual-capacitor (CONFIG_MUTUAL), offset: 0x0 */
    __IO uint32_t CONFIG;                            /**< TSI CONFIG Register (TSI_CONFIG) for self-capacitor, offset: 0x0 */
  };
  __IO uint32_t TSHD;                              /**< TSI Threshold Register, offset: 0x4 */
  __IO uint32_t GENCS;                             /**< TSI General Control and Status Register, offset: 0x8 */
  __IO uint32_t MUL;                               /**< TSI Mutual-cap Register, offset: 0xC */
  __IO uint32_t SINC;                              /**< TSI SINC Filter Register, offset: 0x10 */
  __IO uint32_t SSC0;                              /**< TSI SSC Register 0, offset: 0x14 */
  __IO uint32_t SSC1;                              /**< TSI SSC Register 1, offset: 0x18 */
  __IO uint32_t SSC2;                              /**< TSI SSC Register 2, offset: 0x1C */
  __IO uint32_t BASELINE;                          /**< TSI Baseline Register, offset: 0x20 */
       uint8_t RESERVED_0[4];
  __IO uint32_t SHIELD;                            /**< TSI Shield Register, offset: 0x28 */
  __IO uint32_t SELF_SEL_31_0;                     /**< Self-cap mode channels selection(CH31~CH0), offset: 0x2C */
  __IO uint32_t SELF_SEL_63_32;                    /**< Self-cap mode channels selection(CH63~CH32), offset: 0x30 */
  __IO uint32_t SELF_SEL_69_64;                    /**< Self-cap mode channels selection(CH69~CH64), offset: 0x34 */
  __IO uint32_t SHIELD_SEL_31_0;                   /**< Shield mode channels selection(CH31~CH0), offset: 0x38 */
  __IO uint32_t SHIELD_SEL_63_32;                  /**< Shield mode channels selection(CH63~CH32), offset: 0x3C */
  __IO uint32_t SHIELD_SEL_69_64;                  /**< Shield mode channels selection(CH69~CH64), offset: 0x40 */
  __IO uint32_t MUTUAL_TX_SEL_31_0;                /**< Mutual TX mode channels selection(CH31~CH0), offset: 0x44 */
  __IO uint32_t MUTUAL_TX_SEL_63_32;               /**< Mutual TX mode channels selection(CH63~CH32), offset: 0x48 */
  __IO uint32_t MUTUAL_TX_SEL_69_64;               /**< Mutual TX mode channels selection(CH69~CH64), offset: 0x4C */
  __IO uint32_t MUTUAL_RX_SEL_31_0;                /**< Mutual RX mode channels selection(CH31~CH0), offset: 0x50 */
  __IO uint32_t MUTUAL_RX_SEL_63_32;               /**< Mutual RX mode channels selection(CH63~CH32), offset: 0x54 */
  __IO uint32_t MUTUAL_RX_SEL_69_64;               /**< Mutual RX mode channels selection (CH69~CH64), offset: 0x58 */
       uint8_t RESERVED_1[164];
  __IO uint32_t DATA;                              /**< TSI Data and Status Register, offset: 0x100 */
       uint8_t RESERVED_2[4];
  __IO uint32_t MISC;                              /**< TSI Miscellaneous Register, offset: 0x108 */
  __IO uint32_t TRIG;                              /**< TSI AUTO TRIG Register, offset: 0x10C */
  __IO uint32_t TEST;                              /**< TSI TEST Register, offset: 0x110 */
} TSI_Type;

/* ----------------------------------------------------------------------------
   -- TSI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSI_Register_Masks TSI Register Masks
 * @{
 */

/*! @name CONFIG_MUTUAL - TSI CONFIG register (TSI_CONFIG) for mutual-capacitor (CONFIG_MUTUAL) */
/*! @{ */

#define TSI_CONFIG_MUTUAL_MODE_MASK              (0x1U)
#define TSI_CONFIG_MUTUAL_MODE_SHIFT             (0U)
/*! MODE - MODE
 *  0b0..Self-cap mode, this address is TSI_CONFIG for self-cap
 *  0b1..Mutual-cap mode, this address is TSI_CONFIG for mutual-cap
 */
#define TSI_CONFIG_MUTUAL_MODE(x)                (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_MODE_SHIFT)) & TSI_CONFIG_MUTUAL_MODE_MASK)

#define TSI_CONFIG_MUTUAL_M_NMIRROR_MASK         (0x6U)
#define TSI_CONFIG_MUTUAL_M_NMIRROR_SHIFT        (1U)
/*! M_NMIRROR - M_NMIRROR
 *  0b00..m=1
 *  0b01..m=2
 *  0b10..m=3
 *  0b11..m=4 (default)
 */
#define TSI_CONFIG_MUTUAL_M_NMIRROR(x)           (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_NMIRROR_SHIFT)) & TSI_CONFIG_MUTUAL_M_NMIRROR_MASK)

