zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
#define TSI_CONFIG_MUTUAL_M_PMIRRORR_MASK        (0x18U)
#define TSI_CONFIG_MUTUAL_M_PMIRRORR_SHIFT       (3U)
/*! M_PMIRRORR - M_PMIRRORR
 *  0b00..m=1
 *  0b01..m=2
 *  0b10..m=3
 *  0b11..m=4 (default)
 */
#define TSI_CONFIG_MUTUAL_M_PMIRRORR(x)          (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PMIRRORR_SHIFT)) & TSI_CONFIG_MUTUAL_M_PMIRRORR_MASK)

#define TSI_CONFIG_MUTUAL_M_PMIRRORL_MASK        (0xE0U)
#define TSI_CONFIG_MUTUAL_M_PMIRRORL_SHIFT       (5U)
/*! M_PMIRRORL - M_PMIRRORL
 *  0b000..m=4
 *  0b001..m=8
 *  0b010..m=12
 *  0b011..m=16 (default)
 *  0b100..m=20
 *  0b101..m=24
 *  0b110..m=28
 *  0b111..m=32
 */
#define TSI_CONFIG_MUTUAL_M_PMIRRORL(x)          (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PMIRRORL_SHIFT)) & TSI_CONFIG_MUTUAL_M_PMIRRORL_MASK)

#define TSI_CONFIG_MUTUAL_M_CNT_EN_MASK          (0x10000U)
#define TSI_CONFIG_MUTUAL_M_CNT_EN_SHIFT         (16U)
/*! M_CNT_EN - M_CNT_EN
 *  0b0..Disable, the counter works in all scan process
 *  0b1..Enable, the counter only works when the capacitor does the integration
 */
#define TSI_CONFIG_MUTUAL_M_CNT_EN(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_CNT_EN_SHIFT)) & TSI_CONFIG_MUTUAL_M_CNT_EN_MASK)

#define TSI_CONFIG_MUTUAL_M_TX_PD_EN_MASK        (0x20000U)
#define TSI_CONFIG_MUTUAL_M_TX_PD_EN_SHIFT       (17U)
/*! M_TX_PD_EN - M_TX_PD_EN
 *  0b0..Disable
 *  0b1..Enable (default)
 */
#define TSI_CONFIG_MUTUAL_M_TX_PD_EN(x)          (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_TX_PD_EN_SHIFT)) & TSI_CONFIG_MUTUAL_M_TX_PD_EN_MASK)

#define TSI_CONFIG_MUTUAL_M_SEN_BOOST_MASK       (0x7C0000U)
#define TSI_CONFIG_MUTUAL_M_SEN_BOOST_SHIFT      (18U)
/*! M_SEN_BOOST - M_SEN_BOOST
 *  0b00000..0 u
 *  0b00001..2 u
 *  0b00010..4 u
 *  0b00011..6 u
 *  0b00100..8 u
 *  0b00101..10 u
 *  0b00110..12 u
 *  0b00111..14 u
 *  0b01000..16 u
 *  0b01001..18 u
 *  0b01010..20 u
 *  0b01011..22 u
 *  0b01100..24 u
 *  0b01101..26 u
 *  0b01110..28 u
 *  0b01111..30 u
 *  0b10000..32 u
 *  0b10001..34 u
 *  0b10010..36 u
 *  0b10011..38 u
 *  0b10100..40 u
 *  0b10101..42 u
 *  0b10110..44 u
 *  0b10111..46 u
 *  0b11000..48 u
 *  0b11001..50 u
 *  0b11010..52 u
 *  0b11011..54 u
 *  0b11100..56 u
 *  0b11101..58 u
 *  0b11110..60 u
 *  0b11111..62 u
 */
#define TSI_CONFIG_MUTUAL_M_SEN_BOOST(x)         (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_SEN_BOOST_SHIFT)) & TSI_CONFIG_MUTUAL_M_SEN_BOOST_MASK)

#define TSI_CONFIG_MUTUAL_PRE_CHRG_MODE_MASK     (0x800000U)
#define TSI_CONFIG_MUTUAL_PRE_CHRG_MODE_SHIFT    (23U)
/*! PRE_CHRG_MODE - PRE_CHRG_MODE
 *  0b0..Mode 0
 *  0b1..Mode 1
 */
#define TSI_CONFIG_MUTUAL_PRE_CHRG_MODE(x)       (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_PRE_CHRG_MODE_SHIFT)) & TSI_CONFIG_MUTUAL_PRE_CHRG_MODE_MASK)

#define TSI_CONFIG_MUTUAL_M_PRE_RES_MASK         (0x1C000000U)
#define TSI_CONFIG_MUTUAL_M_PRE_RES_SHIFT        (26U)
/*! M_PRE_RES - M_PRE_RES
 *  0b000..1 kohm
 *  0b001..2 kohm
 *  0b010..3 kohm
 *  0b011..4 kohm
 *  0b100..5 kohm
 *  0b101..6 kohm
 *  0b110..7 kohm
 *  0b111..8 kohm
 */
#define TSI_CONFIG_MUTUAL_M_PRE_RES(x)           (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PRE_RES_SHIFT)) & TSI_CONFIG_MUTUAL_M_PRE_RES_MASK)

#define TSI_CONFIG_MUTUAL_M_PRE_CURRENT_MASK     (0xE0000000U)
#define TSI_CONFIG_MUTUAL_M_PRE_CURRENT_SHIFT    (29U)
/*! M_PRE_CURRENT - M_PRE_CURRENT
 *  0b000..1 uA
 *  0b001..2 uA
 *  0b010..3 uA
 *  0b011..4 uA
 *  0b100..5 uA
 *  0b101..6 uA
 *  0b110..7 uA
 *  0b111..8 uA
 */
#define TSI_CONFIG_MUTUAL_M_PRE_CURRENT(x)       (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MUTUAL_M_PRE_CURRENT_SHIFT)) & TSI_CONFIG_MUTUAL_M_PRE_CURRENT_MASK)
/*! @} */

/*! @name CONFIG - TSI CONFIG Register (TSI_CONFIG) for self-capacitor */
/*! @{ */

#define TSI_CONFIG_MODE_MASK                     (0x1U)
#define TSI_CONFIG_MODE_SHIFT                    (0U)
/*! MODE - MODE
 *  0b0..Self-cap mode, this address is TSI_SEL_CONFIG
 *  0b1..Mutual-cap mode, this address is TSI_MUL_CONFIG
 */
#define TSI_CONFIG_MODE(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_MODE_SHIFT)) & TSI_CONFIG_MODE_MASK)

#define TSI_CONFIG_FILTER_TRIM_MASK              (0x30U)
#define TSI_CONFIG_FILTER_TRIM_SHIFT             (4U)
/*! FILTER_TRIM - FILTER_TRIM
 *  0b00..filter bypass
 *  0b01..5.3ns
 *  0b10..21.1ns
 *  0b11..25ns
 */
#define TSI_CONFIG_FILTER_TRIM(x)                (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_FILTER_TRIM_SHIFT)) & TSI_CONFIG_FILTER_TRIM_MASK)

#define TSI_CONFIG_SELF_BYPASS_FLT_MASK          (0x40U)
#define TSI_CONFIG_SELF_BYPASS_FLT_SHIFT         (6U)
/*! SELF_BYPASS_FLT - self_bypass_flt
 *  0b0..LPF is not bypassed (default)
 *  0b1..LPF is bypassed
 */
#define TSI_CONFIG_SELF_BYPASS_FLT(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_SELF_BYPASS_FLT_SHIFT)) & TSI_CONFIG_SELF_BYPASS_FLT_MASK)

#define TSI_CONFIG_XIN_SCALE_DOWN_TRIM_MASK      (0xF00U)
#define TSI_CONFIG_XIN_SCALE_DOWN_TRIM_SHIFT     (8U)
/*! XIN_SCALE_DOWN_TRIM - xin_scale_down_trim
 *  0b0000..1 (default)
 *  0b0001..1/2
 *  0b0010..1/3
 *  0b0011..1/4
 *  0b0100..1/5
 *  0b0101..1/6
 *  0b0110..1/7
 *  0b0111..1/8
 *  0b1000..Reserved
 *  0b1001..Reserved
 *  0b1010..Reserved
 *  0b1011..Reserved
 *  0b1100..Reserved
 *  0b1101..Reserved
 *  0b1110..Reserved
 *  0b1111..Reserved
 */
#define TSI_CONFIG_XIN_SCALE_DOWN_TRIM(x)        (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_XIN_SCALE_DOWN_TRIM_SHIFT)) & TSI_CONFIG_XIN_SCALE_DOWN_TRIM_MASK)

#define TSI_CONFIG_XIN_SCALE_DOWN_MASK           (0xF000U)
#define TSI_CONFIG_XIN_SCALE_DOWN_SHIFT          (12U)
/*! XIN_SCALE_DOWN - xin_scale_down
 *  0b0000..1 (default)
 *  0b0001..1/2
 *  0b0010..1/3
 *  0b0011..1/4
 *  0b0100..1/5
 *  0b0101..1/6
 *  0b0110..1/7
 *  0b0111..1/8
 *  0b1000..Reserved
 *  0b1001..Reserved
 *  0b1010..Reserved
 *  0b1011..Reserved
 *  0b1100..Reserved
 *  0b1101..Reserved
 *  0b1110..Reserved
 *  0b1111..Reserved
 */
#define TSI_CONFIG_XIN_SCALE_DOWN(x)             (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_XIN_SCALE_DOWN_SHIFT)) & TSI_CONFIG_XIN_SCALE_DOWN_MASK)

