zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
#define TSI_CONFIG_SELF_BOOST_SCALE_MASK         (0x70000U)
#define TSI_CONFIG_SELF_BOOST_SCALE_SHIFT        (16U)
/*! SELF_BOOST_SCALE - self_boost_scale
 *  0b000..500 nA (default)
 *  0b001..1 uA
 *  0b010..1.5 uA
 *  0b011..2 uA
 *  0b100..2.5 uA
 *  0b101..3 uA
 *  0b110..3.5 uA
 *  0b111..4 uA
 */
#define TSI_CONFIG_SELF_BOOST_SCALE(x)           (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_SELF_BOOST_SCALE_SHIFT)) & TSI_CONFIG_SELF_BOOST_SCALE_MASK)

#define TSI_CONFIG_S_NOISE_MASK                  (0x80000U)
#define TSI_CONFIG_S_NOISE_SHIFT                 (19U)
/*! S_NOISE - S_NOISE
 *  0b0..Noise cancellation off (default)
 *  0b1..Noise cancellation on
 */
#define TSI_CONFIG_S_NOISE(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_NOISE_SHIFT)) & TSI_CONFIG_S_NOISE_MASK)

#define TSI_CONFIG_S_XCH_MASK                    (0x700000U)
#define TSI_CONFIG_S_XCH_SHIFT                   (20U)
/*! S_XCH - S_XCH
 *  0b000..1/16 (default)
 *  0b001..1/8
 *  0b010..1/4
 *  0b011..1/2
 *  0b100..1/1
 *  0b101..2/1
 *  0b110..4/1
 *  0b111..8/1
 */
#define TSI_CONFIG_S_XCH(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XCH_SHIFT)) & TSI_CONFIG_S_XCH_MASK)

#define TSI_CONFIG_S_XIN_MASK                    (0x800000U)
#define TSI_CONFIG_S_XIN_SHIFT                   (23U)
/*! S_XIN - S_XIN
 *  0b0..1/8
 *  0b1..1/4 (default)
 */
#define TSI_CONFIG_S_XIN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XIN_SHIFT)) & TSI_CONFIG_S_XIN_MASK)

#define TSI_CONFIG_S_SEN_MASK                    (0x8000000U)
#define TSI_CONFIG_S_SEN_SHIFT                   (27U)
/*! S_SEN - S_SEN
 *  0b0..Sensitivity boost off (default)
 *  0b1..Sensitivity boost on
 */
#define TSI_CONFIG_S_SEN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_SEN_SHIFT)) & TSI_CONFIG_S_SEN_MASK)

#define TSI_CONFIG_S_XDN_MASK                    (0x70000000U)
#define TSI_CONFIG_S_XDN_SHIFT                   (28U)
/*! S_XDN - S_XDN
 *  0b000..1/16 (default)
 *  0b001..1/8
 *  0b010..1/4
 *  0b011..1/2
 *  0b100..NA
 *  0b101..NA
 *  0b110..NA
 *  0b111..NA
 */
#define TSI_CONFIG_S_XDN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_S_XDN_SHIFT)) & TSI_CONFIG_S_XDN_MASK)

#define TSI_CONFIG_SELF_BOOST_MODE_MASK          (0x80000000U)
#define TSI_CONFIG_SELF_BOOST_MODE_SHIFT         (31U)
/*! SELF_BOOST_MODE - self_boost_mode
 *  0b0..Cap boost mode (default)
 *  0b1..Current boost mode
 */
#define TSI_CONFIG_SELF_BOOST_MODE(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CONFIG_SELF_BOOST_MODE_SHIFT)) & TSI_CONFIG_SELF_BOOST_MODE_MASK)
/*! @} */

/*! @name TSHD - TSI Threshold Register */
/*! @{ */

#define TSI_TSHD_THRESL_MASK                     (0xFFFFU)
#define TSI_TSHD_THRESL_SHIFT                    (0U)
/*! THRESL - TSI Wakeup Channel Low-Threshold */
#define TSI_TSHD_THRESL(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_TSHD_THRESL_SHIFT)) & TSI_TSHD_THRESL_MASK)

#define TSI_TSHD_THRESH_MASK                     (0xFFFF0000U)
#define TSI_TSHD_THRESH_SHIFT                    (16U)
/*! THRESH - TSI Wakeup Channel High-threshold */
#define TSI_TSHD_THRESH(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_TSHD_THRESH_SHIFT)) & TSI_TSHD_THRESH_MASK)
/*! @} */

/*! @name GENCS - TSI General Control and Status Register */
/*! @{ */

#define TSI_GENCS_DMAEN_EOS_MASK                 (0x1U)
#define TSI_GENCS_DMAEN_EOS_SHIFT                (0U)
/*! DMAEN_EOS - In-progress DMA Transfer Request Enable
 *  0b0..Disable DMA request at End of Scan event
 *  0b1..Enable DMA request at End of event
 */
#define TSI_GENCS_DMAEN_EOS(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DMAEN_EOS_SHIFT)) & TSI_GENCS_DMAEN_EOS_MASK)

#define TSI_GENCS_DMAEN_OUTRG_MASK               (0x4U)
#define TSI_GENCS_DMAEN_OUTRG_SHIFT              (2U)
/*! DMAEN_OUTRG - Out of Range DMA Transfer Request Enable
 *  0b0..Disable DMA request at Out-of-Range event
 *  0b1..Enable DMA request at Out-of-Range event
 */
#define TSI_GENCS_DMAEN_OUTRG(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DMAEN_OUTRG_SHIFT)) & TSI_GENCS_DMAEN_OUTRG_MASK)

#define TSI_GENCS_STM_MASK                       (0x8U)
#define TSI_GENCS_STM_SHIFT                      (3U)
/*! STM - Scan Trigger Mode
 *  0b0..Software trigger scan
 *  0b1..Hardware trigger scan
 */
#define TSI_GENCS_STM(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_STM_SHIFT)) & TSI_GENCS_STM_MASK)

#define TSI_GENCS_TSIEN_MASK                     (0x20U)
#define TSI_GENCS_TSIEN_SHIFT                    (5U)
/*! TSIEN - Touch Sensing Input Module Enable
 *  0b0..TSI module disabled
 *  0b1..TSI module enabled
 */
#define TSI_GENCS_TSIEN(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_TSIEN_SHIFT)) & TSI_GENCS_TSIEN_MASK)

#define TSI_GENCS_CLK_SEL_MASK                   (0x40U)
#define TSI_GENCS_CLK_SEL_SHIFT                  (6U)
/*! CLK_SEL - KHz clock selection
 *  0b0..Select 16K clock to use
 *  0b1..Select 32K clock to use
 */
#define TSI_GENCS_CLK_SEL(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_CLK_SEL_SHIFT)) & TSI_GENCS_CLK_SEL_MASK)

#define TSI_GENCS_SWTS_MASK                      (0x80U)
#define TSI_GENCS_SWTS_SHIFT                     (7U)
/*! SWTS - Software Trigger Start
 *  0b0..No effect
 *  0b1..Takes effect
 */
#define TSI_GENCS_SWTS(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_SWTS_SHIFT)) & TSI_GENCS_SWTS_MASK)

#define TSI_GENCS_TSIEN_DPD_MASK                 (0x100U)
#define TSI_GENCS_TSIEN_DPD_SHIFT                (8U)
/*! TSIEN_DPD - Enable of 3v domain logic in this IP
 *  0b0..3v domain logic is disabled
 *  0b1..3v domain logic is enabled
 */
#define TSI_GENCS_TSIEN_DPD(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_TSIEN_DPD_SHIFT)) & TSI_GENCS_TSIEN_DPD_MASK)

#define TSI_GENCS_DVOLT_MASK                     (0xF000U)
#define TSI_GENCS_DVOLT_SHIFT                    (12U)
/*! DVOLT - DVOLT
 *  0b0000..Vm=0.6 V, Vp=1.73 V
 *  0b0001..Vm=0.6 V, Vp=1.82 V
 *  0b0010..Vm=0.6 V, Vp=1.89 V
 *  0b0011..Vm=0.6 V, Vp=1.98 V
 *  0b0100..Vm=0.6 V, Vp=2.06 V
 *  0b0101..Vm=0.6 V, Vp=2.14 V
 *  0b0110..Vm=0.6 V, Vp=2.23 V
 *  0b0111..Vm=0.6 V, Vp=2.31 V
 *  0b1000..Vm=0.6 V, Vp=2.39 V
 *  0b1001..Vm=0.6 V, Vp=2.47 V
 *  0b1010..Vm=0.6 V, Vp=2.56 V
 *  0b1011..Vm=0.6 V, Vp=2.64 V
 *  0b1100..Vm=0.6 V, Vp=2.72 V
 *  0b1101..Vm=0.6 V, Vp=2.81 V
 *  0b1110..Vm=0.6 V, Vp=2.88 V
 *  0b1111..Vm=0.6 V, Vp=2.97 V
 */
#define TSI_GENCS_DVOLT(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DVOLT_SHIFT)) & TSI_GENCS_DVOLT_MASK)

#define TSI_GENCS_DEBOUNCE_COUNTER_CONFIGURED_MASK (0x1F0000U)
#define TSI_GENCS_DEBOUNCE_COUNTER_CONFIGURED_SHIFT (16U)
/*! DEBOUNCE_COUNTER_CONFIGURED - DEBOUNCE
 *  0b00000..1 out of range event can generate interrupt
 *  0b00001..2 out of range events can generate interrupt
 *  0b00010..3 out of range events can generate interrupt
 *  0b00011..4 out of range events can generate interrupt
 *  0b00100..5 out of range events can generate interrupt
 *  0b00101..6 out of range events can generate interrupt
 *  0b00110..7 out of range events can generate interrupt
 *  0b00111..8 out of range events can generate interrupt
 *  0b01000..9 out of range events can generate interrupt
 *  0b01001..10 out of range events can generate interrupt
 *  0b01010..11 out of range events can generate interrupt
 *  0b01011..12 out of range events can generate interrupt
 *  0b01100..13 out of range events can generate interrupt
 *  0b01101..14 out of range events can generate interrupt
 *  0b01110..15 out of range events can generate interrupt
 *  0b01111..16 out of range events can generate interrupt
 *  0b10000..17 out of range events can generate interrupt
 *  0b10001..18 out of range events can generate interrupt
 *  0b10010..19 out of range events can generate interrupt
 *  0b10011..20 out of range events can generate interrupt
 *  0b10100..21 out of range events can generate interrupt
 *  0b10101..22 out of range events can generate interrupt
 *  0b10110..23 out of range events can generate interrupt
 *  0b10111..24 out of range events can generate interrupt
 *  0b11000..25 out of range events can generate interrupt
 *  0b11001..26 out of range events can generate interrupt
 *  0b11010..27 out of range events can generate interrupt
 *  0b11011..28 out of range events can generate interrupt
 *  0b11100..29 out of range events can generate interrupt
 *  0b11101..30 out of range events can generate interrupt
 *  0b11110..31 out of range events can generate interrupt
 *  0b11111..32 out of range events can generate interrupt
 */
#define TSI_GENCS_DEBOUNCE_COUNTER_CONFIGURED(x) (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DEBOUNCE_COUNTER_CONFIGURED_SHIFT)) & TSI_GENCS_DEBOUNCE_COUNTER_CONFIGURED_MASK)

#define TSI_GENCS_ESOR_MASK                      (0x8000000U)
#define TSI_GENCS_ESOR_SHIFT                     (27U)
/*! ESOR - End of Scan Interrupt enable.
 *  0b0..End of Scan interrupt is disable
 *  0b1..End of Scan interrupt is enabled
 */
#define TSI_GENCS_ESOR(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_ESOR_SHIFT)) & TSI_GENCS_ESOR_MASK)

#define TSI_GENCS_OUTRG_EN_MASK                  (0x40000000U)
#define TSI_GENCS_OUTRG_EN_SHIFT                 (30U)
/*! OUTRG_EN - Out-of-range interrupt enable.
 *  0b0..Out-of-range interrupt is disable
 *  0b1..Out-of-range interrupt is enabled
 */
#define TSI_GENCS_OUTRG_EN(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_OUTRG_EN_SHIFT)) & TSI_GENCS_OUTRG_EN_MASK)
/*! @} */

/*! @name MUL - TSI Mutual-cap Register */
/*! @{ */

#define TSI_MUL_M_VPRE_CHOOSE_MASK               (0x1U)
#define TSI_MUL_M_VPRE_CHOOSE_SHIFT              (0U)
/*! M_VPRE_CHOOSE - M_VPRE_CHOOSE
 *  0b0..Internal 1.2 V voltage (default)
 *  0b1..External 1.2 V voltage from PMC
 */
#define TSI_MUL_M_VPRE_CHOOSE(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_VPRE_CHOOSE_SHIFT)) & TSI_MUL_M_VPRE_CHOOSE_MASK)

#define TSI_MUL_M_MODE_MASK                      (0x6U)
#define TSI_MUL_M_MODE_SHIFT                     (1U)
/*! M_MODE - M_MODE
 *  0b00..Sense both pos and neg side
 *  0b01..Sense pos side only
 *  0b10..Sense neg side only
 *  0b11..Not allowed
 */
#define TSI_MUL_M_MODE(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_MODE_SHIFT)) & TSI_MUL_M_MODE_MASK)

#define TSI_MUL_M_TRIM_CAP_MASK                  (0x18U)
#define TSI_MUL_M_TRIM_CAP_SHIFT                 (3U)
/*! M_TRIM_CAP - M_TRIM_CAP
 *  0b00..0 pF (default)
 *  0b01..10 pF
 *  0b10..10 pF
 *  0b11..20 pF
 */
#define TSI_MUL_M_TRIM_CAP(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_TRIM_CAP_SHIFT)) & TSI_MUL_M_TRIM_CAP_MASK)

#define TSI_MUL_M_TRIM_USED_MASK                 (0xFFFF0000U)
#define TSI_MUL_M_TRIM_USED_SHIFT                (16U)
/*! M_TRIM_USED - Not use, just reserved */
#define TSI_MUL_M_TRIM_USED(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_TRIM_USED_SHIFT)) & TSI_MUL_M_TRIM_USED_MASK)
/*! @} */

/*! @name SINC - TSI SINC Filter Register */
/*! @{ */

#define TSI_SINC_SSC_CONTROL_OUT_MASK            (0x1U)
#define TSI_SINC_SSC_CONTROL_OUT_SHIFT           (0U)
/*! SSC_CONTROL_OUT - SSC_CONTROL_OUT
 *  0b0..SSC output value is 0
 *  0b1..SSC output value is 1
 */
#define TSI_SINC_SSC_CONTROL_OUT(x)              (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SSC_CONTROL_OUT_SHIFT)) & TSI_SINC_SSC_CONTROL_OUT_MASK)

#define TSI_SINC_SINC_VALID_MASK                 (0x2U)
#define TSI_SINC_SINC_VALID_SHIFT                (1U)
/*! SINC_VALID - SINC_VALID
 *  0b0..SINC filter is disabled
 *  0b1..SINC filter is enabled
 */
#define TSI_SINC_SINC_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_VALID_SHIFT)) & TSI_SINC_SINC_VALID_MASK)

#define TSI_SINC_SINC_OVERFLOW_FLAG_MASK         (0x4U)
#define TSI_SINC_SINC_OVERFLOW_FLAG_SHIFT        (2U)
/*! SINC_OVERFLOW_FLAG - SINC_OVERFLOW_FLAG
 *  0b0..The counter result has no overflow occurrence in the last scan process
 *  0b1..The counter result has an overflow occurrence in the last scan process
 */
#define TSI_SINC_SINC_OVERFLOW_FLAG(x)           (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_OVERFLOW_FLAG_SHIFT)) & TSI_SINC_SINC_OVERFLOW_FLAG_MASK)

