zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
#define TSI_SINC_SWITCH_ENABLE_MASK              (0x8U)
#define TSI_SINC_SWITCH_ENABLE_SHIFT             (3U)
/*! SWITCH_ENABLE - SWITCH_ENABLE
 *  0b0..SSC function is disabled
 *  0b1..SSC function is enabled
 */
#define TSI_SINC_SWITCH_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SWITCH_ENABLE_SHIFT)) & TSI_SINC_SWITCH_ENABLE_MASK)

#define TSI_SINC_SINC_DECIMATION_MASK            (0x1F0000U)
#define TSI_SINC_SINC_DECIMATION_SHIFT           (16U)
/*! SINC_DECIMATION - SINC_DECIMATION
 *  0b00000..The TSI_DATA[TSICNT] bits is the counter value of 1 trigger period
 *  0b00001..The TSI_DATA[TSICNT] bits is the counter value of 2 trigger periods
 *  0b00010..The TSI_DATA[TSICNT] bits is the counter value of 3 trigger periods
 *  0b00011..The TSI_DATA[TSICNT] bits is the counter value of 4 trigger periods
 *  0b00100..The TSI_DATA[TSICNT] bits is the counter value of 5 trigger periods
 *  0b00101..The TSI_DATA[TSICNT] bits is the counter value of 6 trigger periods
 *  0b00110..The TSI_DATA[TSICNT] bits is the counter value of 7 trigger periods
 *  0b00111..The TSI_DATA[TSICNT] bits is the counter value of 8 trigger periods
 *  0b01000..The TSI_DATA[TSICNT] bits is the counter value of 9 trigger periods
 *  0b01001..The TSI_DATA[TSICNT] bits is the counter value of 10 trigger periods
 *  0b01010..The TSI_DATA[TSICNT] bits is the counter value of 11 trigger periods
 *  0b01011..The TSI_DATA[TSICNT] bits is the counter value of 12 trigger periods
 *  0b01100..The TSI_DATA[TSICNT] bits is the counter value of 13 trigger periods
 *  0b01101..The TSI_DATA[TSICNT] bits is the counter value of 14 trigger periods
 *  0b01110..The TSI_DATA[TSICNT] bits is the counter value of 15 trigger periods
 *  0b01111..The TSI_DATA[TSICNT] bits is the counter value of 16 trigger periods
 *  0b10000..The TSI_DATA[TSICNT] bits is the counter value of 17 trigger periods
 *  0b10001..The TSI_DATA[TSICNT] bits is the counter value of 18 trigger periods
 *  0b10010..The TSI_DATA[TSICNT] bits is the counter value of 19 trigger periods
 *  0b10011..The TSI_DATA[TSICNT] bits is the counter value of 20 trigger periods
 *  0b10100..The TSI_DATA[TSICNT] bits is the counter value of 21 trigger periods
 *  0b10101..The TSI_DATA[TSICNT] bits is the counter value of 22 trigger periods
 *  0b10110..The TSI_DATA[TSICNT] bits is the counter value of 23 trigger periods
 *  0b10111..The TSI_DATA[TSICNT] bits is the counter value of 24 trigger periods
 *  0b11000..The TSI_DATA[TSICNT] bits is the counter value of 25 trigger periods
 *  0b11001..The TSI_DATA[TSICNT] bits is the counter value of 26 trigger periods
 *  0b11010..The TSI_DATA[TSICNT] bits is the counter value of 27 trigger periods
 *  0b11011..The TSI_DATA[TSICNT] bits is the counter value of 28 trigger periods
 *  0b11100..The TSI_DATA[TSICNT] bits is the counter value of 29 trigger periods
 *  0b11101..The TSI_DATA[TSICNT] bits is the counter value of 30 trigger periods
 *  0b11110..The TSI_DATA[TSICNT] bits is the counter value of 31 trigger periods
 *  0b11111..The TSI_DATA[TSICNT] bits is the counter value of 32 trigger periods
 */
#define TSI_SINC_SINC_DECIMATION(x)              (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_DECIMATION_SHIFT)) & TSI_SINC_SINC_DECIMATION_MASK)

#define TSI_SINC_SINC_ORDER_MASK                 (0x200000U)
#define TSI_SINC_SINC_ORDER_SHIFT                (21U)
/*! SINC_ORDER - SINC_ORDER
 *  0b0..Using 1 order sinc filter
 *  0b1..Using 2 order sinc filter
 */
#define TSI_SINC_SINC_ORDER(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_ORDER_SHIFT)) & TSI_SINC_SINC_ORDER_MASK)

#define TSI_SINC_SINC_CUTOFF_MASK                (0xF000000U)
#define TSI_SINC_SINC_CUTOFF_SHIFT               (24U)
/*! SINC_CUTOFF - SINC_CUTOFF
 *  0b0000..div=1
 *  0b0001..div=2
 *  0b0010..div=4
 *  0b0011..div=8
 *  0b0100..div=16
 *  0b0101..div=32
 *  0b0110..div=64
 *  0b0111..div=128
 *  0b1000..NC
 *  0b1001..NC
 *  0b1010..NC
 *  0b1011..NC
 *  0b1100..NC
 *  0b1101..NC
 *  0b1110..NC
 *  0b1111..NC
 */
#define TSI_SINC_SINC_CUTOFF(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_CUTOFF_SHIFT)) & TSI_SINC_SINC_CUTOFF_MASK)
/*! @} */

/*! @name SSC0 - TSI SSC Register 0 */
/*! @{ */

#define TSI_SSC0_SSC_PRESCALE_NUM_MASK           (0xFFFU)
#define TSI_SSC0_SSC_PRESCALE_NUM_SHIFT          (0U)
/*! SSC_PRESCALE_NUM - SSC_PRESCALE_NUM
 *  0b000000000000..div1
 *  0b000000000001..div2
 *  0b000000000011..div4
 *  0b000000000111..div8
 *  0b000000001111..div16
 *  0b000000011111..div32
 *  0b000000111111..div64
 *  0b000001111111..div128
 *  0b000011111111..div256
 */
#define TSI_SSC0_SSC_PRESCALE_NUM(x)             (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_SSC_PRESCALE_NUM_SHIFT)) & TSI_SSC0_SSC_PRESCALE_NUM_MASK)

#define TSI_SSC0_BASE_NOCHARGE_NUM_MASK          (0xF0000U)
#define TSI_SSC0_BASE_NOCHARGE_NUM_SHIFT         (16U)
/*! BASE_NOCHARGE_NUM - BASE_NOCHARGE_NUM
 *  0b0000..The SSC output bit 1's basic period will be 1 clock cycle of system clock
 *  0b0001..The SSC output bit 1's basic period will be 2 clock cycles of system clock
 *  0b0010..The SSC output bit 1's basic period will be 3 clock cycles of system clock
 *  0b0011..The SSC output bit 1's basic period will be 4 clock cycles of system clock
 *  0b0100..The SSC output bit 1's basic period will be 5 clock cycles of system clock
 *  0b0101..The SSC output bit 1's basic period will be 6 clock cycles of system clock
 *  0b0110..The SSC output bit 1's basic period will be 7 clock cycles of system clock
 *  0b0111..The SSC output bit 1's basic period will be 8 clock cycles of system clock
 *  0b1000..The SSC output bit 1's basic period will be 9 clock cycles of system clock
 *  0b1001..The SSC output bit 1's basic period will be 10 clock cycles of system clock
 *  0b1010..The SSC output bit 1's basic period will be 11 clock cycles of system clock
 *  0b1011..The SSC output bit 1's basic period will be 12 clock cycles of system clock
 *  0b1100..The SSC output bit 1's basic period will be 13 clock cycles of system clock
 *  0b1101..The SSC output bit 1's basic period will be 14 clock cycles of system clock
 *  0b1110..The SSC output bit 1's basic period will be 15 clock cycles of system clock
 *  0b1111..The SSC output bit 1's basic period will be 16 clock cycles of system clock
 */
#define TSI_SSC0_BASE_NOCHARGE_NUM(x)            (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_BASE_NOCHARGE_NUM_SHIFT)) & TSI_SSC0_BASE_NOCHARGE_NUM_MASK)

#define TSI_SSC0_CHARGE_NUM_MASK                 (0xF00000U)
#define TSI_SSC0_CHARGE_NUM_SHIFT                (20U)
/*! CHARGE_NUM - CHARGE_NUM
 *  0b0000..The SSC output bit 0's period will be 1 clock cycle of system clock
 *  0b0001..The SSC output bit 0's period will be 2 clock cycles of system clock
 *  0b0010..The SSC output bit 0's period will be 3 clock cycles of system clock
 *  0b0011..The SSC output bit 0's period will be 4 clock cycles of system clock
 *  0b0100..The SSC output bit 0's period will be 5 clock cycles of system clock
 *  0b0101..The SSC output bit 0's period will be 6 clock cycles of system clock
 *  0b0110..The SSC output bit 0's period will be 7 clock cycles of system clock
 *  0b0111..The SSC output bit 0's period will be 8 clock cycles of system clock
 *  0b1000..The SSC output bit 0's period will be 9 clock cycles of system clock
 *  0b1001..The SSC output bit 0's period will be 10 clock cycles of system clock
 *  0b1010..The SSC output bit 0's period will be 11 clock cycles of system clock
 *  0b1011..The SSC output bit 0's period will be 12 clock cycles of system clock
 *  0b1100..The SSC output bit 0's period will be 13 clock cycles of system clock
 *  0b1101..The SSC output bit 0's period will be 14 clock cycles of system clock
 *  0b1110..The SSC output bit 0's period will be 15 clock cycles of system clock
 *  0b1111..The SSC output bit 0's period will be 16 clock cycles of system clock
 */
#define TSI_SSC0_CHARGE_NUM(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_CHARGE_NUM_SHIFT)) & TSI_SSC0_CHARGE_NUM_MASK)

#define TSI_SSC0_SSC_CONTROL_REVERSE_MASK        (0x1000000U)
#define TSI_SSC0_SSC_CONTROL_REVERSE_SHIFT       (24U)
/*! SSC_CONTROL_REVERSE - SSC_CONTROL_REVERSE
 *  0b0..Keep the polarity of the SSC output bit
 *  0b1..Reverse the polarity of the SSC output bit
 */
#define TSI_SSC0_SSC_CONTROL_REVERSE(x)          (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_SSC_CONTROL_REVERSE_SHIFT)) & TSI_SSC0_SSC_CONTROL_REVERSE_MASK)

