zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
/*! @name BASELINE - TSI Baseline Register */
/*! @{ */

#define TSI_BASELINE_TSI_BASELINE_MASK           (0xFFFFU)
#define TSI_BASELINE_TSI_BASELINE_SHIFT          (0U)
/*! TSI_BASELINE - TSI_BASELINE */
#define TSI_BASELINE_TSI_BASELINE(x)             (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_TSI_BASELINE_SHIFT)) & TSI_BASELINE_TSI_BASELINE_MASK)

#define TSI_BASELINE_BASE_TRACE_DEBOUNCE_MASK    (0xF0000U)
#define TSI_BASELINE_BASE_TRACE_DEBOUNCE_SHIFT   (16U)
/*! BASE_TRACE_DEBOUNCE - BASE_TRACE_DEBOUNCE
 *  0b0000..The current counter value takes 0 ratio
 *  0b0001..The current counter value takes 1/16 ratio
 *  0b0010..The current counter value takes 2/16 ratio
 *  0b0011..The current counter value takes 3/16 ratio
 *  0b0100..The current counter value takes 4/16 ratio
 *  0b0101..The current counter value takes 5/16 ratio
 *  0b0110..The current counter value take 6/16 ratio
 *  0b0111..The current counter value takes 7/16 ratio
 *  0b1000..The current counter value takes 8/16 ratio
 *  0b1001..The current counter value takes 9/16 ratio
 *  0b1010..The current counter value takes 10/16 ratio
 *  0b1011..The current counter value takes 11/16 ratio
 *  0b1100..The current counter value takes 12/16 ratio
 *  0b1101..The current counter value takes 13/16 ratio
 *  0b1110..The current counter value takes 14/16 ratio
 *  0b1111..The current counter value takes 15/16 ratio
 */
#define TSI_BASELINE_BASE_TRACE_DEBOUNCE(x)      (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_BASE_TRACE_DEBOUNCE_SHIFT)) & TSI_BASELINE_BASE_TRACE_DEBOUNCE_MASK)

#define TSI_BASELINE_BASE_TRACE_EN_MASK          (0x100000U)
#define TSI_BASELINE_BASE_TRACE_EN_SHIFT         (20U)
/*! BASE_TRACE_EN - BASE_TRACE_EN
 *  0b0..Reserved
 *  0b1..Reserved
 */
#define TSI_BASELINE_BASE_TRACE_EN(x)            (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_BASE_TRACE_EN_SHIFT)) & TSI_BASELINE_BASE_TRACE_EN_MASK)

#define TSI_BASELINE_THESHOLD_RATIO_MASK         (0x70000000U)
#define TSI_BASELINE_THESHOLD_RATIO_SHIFT        (28U)
/*! THESHOLD_RATIO - THESHOLD_RATIO
 *  0b000..The thresholdh = baseline+counter/2, and thresholdl = baseline-counter/2
 *  0b001..The thresholdh = baseline+counter/4, and thresholdl = baseline-counter/4
 *  0b010..The thresholdh = baseline+counter/8, and thresholdl = baseline-counter/8
 *  0b011..The thresholdh = baseline+counter/16, and thresholdl = baseline-counter/16
 *  0b100..The thresholdh = baseline+counter/32, and thresholdl = baseline-counter/32
 *  0b101..The thresholdh = baseline+counter/64, and thresholdl = baseline-counter/64
 *  0b110..The thresholdh = baseline+counter/128, and thresholdl = baseline-counter/128
 *  0b111..The thresholdh = baseline+counter/256, and thresholdl = baseline-counter/256
 */
#define TSI_BASELINE_THESHOLD_RATIO(x)           (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_THESHOLD_RATIO_SHIFT)) & TSI_BASELINE_THESHOLD_RATIO_MASK)

#define TSI_BASELINE_THRESHOLD_TRACE_EN_MASK     (0x80000000U)
#define TSI_BASELINE_THRESHOLD_TRACE_EN_SHIFT    (31U)
/*! THRESHOLD_TRACE_EN - THRESHOLD_TRACE_EN
 *  0b0..Disable threshold trace function
 *  0b1..Enable threshold trace function
 */
#define TSI_BASELINE_THRESHOLD_TRACE_EN(x)       (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_THRESHOLD_TRACE_EN_SHIFT)) & TSI_BASELINE_THRESHOLD_TRACE_EN_MASK)
/*! @} */

/*! @name SHIELD - TSI Shield Register */
/*! @{ */

#define TSI_SHIELD_M_SEN_RES_MASK                (0x7E000000U)
#define TSI_SHIELD_M_SEN_RES_SHIFT               (25U)
/*! M_SEN_RES - M_SEN_RES
 *  0b000000..10 k
 *  0b000001..10 k + (2.5/3) k (just for auto-calibration)
 *  0b000010..12.5 k (default)
 *  0b001110..25 k
 */
#define TSI_SHIELD_M_SEN_RES(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_M_SEN_RES_SHIFT)) & TSI_SHIELD_M_SEN_RES_MASK)
/*! @} */

/*! @name SELF_SEL_31_0 - Self-cap mode channels selection(CH31~CH0) */
/*! @{ */

#define TSI_SELF_SEL_31_0_AS_SELF_31_0_MASK      (0xFFFFFFFFU)
#define TSI_SELF_SEL_31_0_AS_SELF_31_0_SHIFT     (0U)
/*! AS_SELF_31_0 - Config TSI channel as self-cap mode among CH31~CH0 */
#define TSI_SELF_SEL_31_0_AS_SELF_31_0(x)        (((uint32_t)(((uint32_t)(x)) << TSI_SELF_SEL_31_0_AS_SELF_31_0_SHIFT)) & TSI_SELF_SEL_31_0_AS_SELF_31_0_MASK)
/*! @} */

/*! @name SELF_SEL_63_32 - Self-cap mode channels selection(CH63~CH32) */
/*! @{ */

#define TSI_SELF_SEL_63_32_AS_SELF_63_32_MASK    (0xFFFFFFFFU)
#define TSI_SELF_SEL_63_32_AS_SELF_63_32_SHIFT   (0U)
/*! AS_SELF_63_32 - Config TSI channel as self-cap mode among CH63~CH32 */
#define TSI_SELF_SEL_63_32_AS_SELF_63_32(x)      (((uint32_t)(((uint32_t)(x)) << TSI_SELF_SEL_63_32_AS_SELF_63_32_SHIFT)) & TSI_SELF_SEL_63_32_AS_SELF_63_32_MASK)
/*! @} */

/*! @name SELF_SEL_69_64 - Self-cap mode channels selection(CH69~CH64) */
/*! @{ */

#define TSI_SELF_SEL_69_64_AS_SELF_69_64_MASK    (0x3FU)
#define TSI_SELF_SEL_69_64_AS_SELF_69_64_SHIFT   (0U)
/*! AS_SELF_69_64 - Config TSI channel as self-cap mode among CH69~CH64 */
#define TSI_SELF_SEL_69_64_AS_SELF_69_64(x)      (((uint32_t)(((uint32_t)(x)) << TSI_SELF_SEL_69_64_AS_SELF_69_64_SHIFT)) & TSI_SELF_SEL_69_64_AS_SELF_69_64_MASK)
/*! @} */

/*! @name SHIELD_SEL_31_0 - Shield mode channels selection(CH31~CH0) */
/*! @{ */

#define TSI_SHIELD_SEL_31_0_AS_SHIELD_31_0_MASK  (0xFFFFFFFFU)
#define TSI_SHIELD_SEL_31_0_AS_SHIELD_31_0_SHIFT (0U)
/*! AS_SHIELD_31_0 - Config TSI channel as shield mode among CH31~CH0 */
#define TSI_SHIELD_SEL_31_0_AS_SHIELD_31_0(x)    (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SEL_31_0_AS_SHIELD_31_0_SHIFT)) & TSI_SHIELD_SEL_31_0_AS_SHIELD_31_0_MASK)
/*! @} */

/*! @name SHIELD_SEL_63_32 - Shield mode channels selection(CH63~CH32) */
/*! @{ */

#define TSI_SHIELD_SEL_63_32_AS_SHIELD_63_32_MASK (0xFFFFFFFFU)
#define TSI_SHIELD_SEL_63_32_AS_SHIELD_63_32_SHIFT (0U)
/*! AS_SHIELD_63_32 - Config TSI channel as shield mode among CH63~CH32 */
#define TSI_SHIELD_SEL_63_32_AS_SHIELD_63_32(x)  (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SEL_63_32_AS_SHIELD_63_32_SHIFT)) & TSI_SHIELD_SEL_63_32_AS_SHIELD_63_32_MASK)
/*! @} */

/*! @name SHIELD_SEL_69_64 - Shield mode channels selection(CH69~CH64) */
/*! @{ */

#define TSI_SHIELD_SEL_69_64_AS_SHIELD_69_64_MASK (0x3FU)
#define TSI_SHIELD_SEL_69_64_AS_SHIELD_69_64_SHIFT (0U)
/*! AS_SHIELD_69_64 - Config TSI channel as shield mode among CH69~CH64 */
#define TSI_SHIELD_SEL_69_64_AS_SHIELD_69_64(x)  (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SEL_69_64_AS_SHIELD_69_64_SHIFT)) & TSI_SHIELD_SEL_69_64_AS_SHIELD_69_64_MASK)
/*! @} */

/*! @name MUTUAL_TX_SEL_31_0 - Mutual TX mode channels selection(CH31~CH0) */
/*! @{ */

#define TSI_MUTUAL_TX_SEL_31_0_AS_MUTUAL_TX_31_0_MASK (0xFFFFFFFFU)
#define TSI_MUTUAL_TX_SEL_31_0_AS_MUTUAL_TX_31_0_SHIFT (0U)
/*! AS_MUTUAL_TX_31_0 - Config TSI channel as mutual TX mode among CH31~CH0 */
#define TSI_MUTUAL_TX_SEL_31_0_AS_MUTUAL_TX_31_0(x) (((uint32_t)(((uint32_t)(x)) << TSI_MUTUAL_TX_SEL_31_0_AS_MUTUAL_TX_31_0_SHIFT)) & TSI_MUTUAL_TX_SEL_31_0_AS_MUTUAL_TX_31_0_MASK)
/*! @} */

/*! @name MUTUAL_TX_SEL_63_32 - Mutual TX mode channels selection(CH63~CH32) */
/*! @{ */

