zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
#define TSI_MUTUAL_TX_SEL_63_32_AS_MUTUAL_TX_63_32_MASK (0xFFFFFFFFU)
#define TSI_MUTUAL_TX_SEL_63_32_AS_MUTUAL_TX_63_32_SHIFT (0U)
/*! AS_MUTUAL_TX_63_32 - Config TSI channel as mutual TX mode among CH63~CH32 */
#define TSI_MUTUAL_TX_SEL_63_32_AS_MUTUAL_TX_63_32(x) (((uint32_t)(((uint32_t)(x)) << TSI_MUTUAL_TX_SEL_63_32_AS_MUTUAL_TX_63_32_SHIFT)) & TSI_MUTUAL_TX_SEL_63_32_AS_MUTUAL_TX_63_32_MASK)
/*! @} */

/*! @name MUTUAL_TX_SEL_69_64 - Mutual TX mode channels selection(CH69~CH64) */
/*! @{ */

#define TSI_MUTUAL_TX_SEL_69_64_AS_MUTUAL_TX_69_64_MASK (0x3FU)
#define TSI_MUTUAL_TX_SEL_69_64_AS_MUTUAL_TX_69_64_SHIFT (0U)
/*! AS_MUTUAL_TX_69_64 - Config TSI channel as mutual TX mode among CH69~CH64 */
#define TSI_MUTUAL_TX_SEL_69_64_AS_MUTUAL_TX_69_64(x) (((uint32_t)(((uint32_t)(x)) << TSI_MUTUAL_TX_SEL_69_64_AS_MUTUAL_TX_69_64_SHIFT)) & TSI_MUTUAL_TX_SEL_69_64_AS_MUTUAL_TX_69_64_MASK)
/*! @} */

/*! @name MUTUAL_RX_SEL_31_0 - Mutual RX mode channels selection(CH31~CH0) */
/*! @{ */

#define TSI_MUTUAL_RX_SEL_31_0_AS_MUTUAL_RX_31_0_MASK (0xFFFFFFFFU)
#define TSI_MUTUAL_RX_SEL_31_0_AS_MUTUAL_RX_31_0_SHIFT (0U)
/*! AS_MUTUAL_RX_31_0 - Config TSI channel as mutual RX mode among CH31~CH0 */
#define TSI_MUTUAL_RX_SEL_31_0_AS_MUTUAL_RX_31_0(x) (((uint32_t)(((uint32_t)(x)) << TSI_MUTUAL_RX_SEL_31_0_AS_MUTUAL_RX_31_0_SHIFT)) & TSI_MUTUAL_RX_SEL_31_0_AS_MUTUAL_RX_31_0_MASK)
/*! @} */

/*! @name MUTUAL_RX_SEL_63_32 - Mutual RX mode channels selection(CH63~CH32) */
/*! @{ */

#define TSI_MUTUAL_RX_SEL_63_32_AS_MUTUAL_RX_63_32_MASK (0xFFFFFFFFU)
#define TSI_MUTUAL_RX_SEL_63_32_AS_MUTUAL_RX_63_32_SHIFT (0U)
/*! AS_MUTUAL_RX_63_32 - Config TSI channel as mutual RX mode among CH63~CH32 */
#define TSI_MUTUAL_RX_SEL_63_32_AS_MUTUAL_RX_63_32(x) (((uint32_t)(((uint32_t)(x)) << TSI_MUTUAL_RX_SEL_63_32_AS_MUTUAL_RX_63_32_SHIFT)) & TSI_MUTUAL_RX_SEL_63_32_AS_MUTUAL_RX_63_32_MASK)
/*! @} */

/*! @name MUTUAL_RX_SEL_69_64 - Mutual RX mode channels selection (CH69~CH64) */
/*! @{ */

#define TSI_MUTUAL_RX_SEL_69_64_AS_MUTUAL_RX_69_64_MASK (0x3FU)
#define TSI_MUTUAL_RX_SEL_69_64_AS_MUTUAL_RX_69_64_SHIFT (0U)
/*! AS_MUTUAL_RX_69_64 - Config TSI channel as mutual RX mode among CH69~CH64 */
#define TSI_MUTUAL_RX_SEL_69_64_AS_MUTUAL_RX_69_64(x) (((uint32_t)(((uint32_t)(x)) << TSI_MUTUAL_RX_SEL_69_64_AS_MUTUAL_RX_69_64_SHIFT)) & TSI_MUTUAL_RX_SEL_69_64_AS_MUTUAL_RX_69_64_MASK)
/*! @} */

/*! @name DATA - TSI Data and Status Register */
/*! @{ */

#define TSI_DATA_TSICNT_MASK                     (0xFFFFU)
#define TSI_DATA_TSICNT_SHIFT                    (0U)
/*! TSICNT - TSI Conversion Counter Value */
#define TSI_DATA_TSICNT(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_DATA_TSICNT_SHIFT)) & TSI_DATA_TSICNT_MASK)

#define TSI_DATA_TSICNT_OVERFLOW_FLAG_MASK       (0x10000U)
#define TSI_DATA_TSICNT_OVERFLOW_FLAG_SHIFT      (16U)
/*! TSICNT_OVERFLOW_FLAG - TSI Counter Overflow Flag
 *  0b0..The DATA[TSICNT] value has no overflow occurrence in the last scan process
 *  0b1..The DATA[TSICNT] value has an overflow occurrence in the last scan process
 */
#define TSI_DATA_TSICNT_OVERFLOW_FLAG(x)         (((uint32_t)(((uint32_t)(x)) << TSI_DATA_TSICNT_OVERFLOW_FLAG_SHIFT)) & TSI_DATA_TSICNT_OVERFLOW_FLAG_MASK)

#define TSI_DATA_EOSF_MASK                       (0x8000000U)
#define TSI_DATA_EOSF_SHIFT                      (27U)
/*! EOSF - End of Scan Flag
 *  0b0..Scan is not done
 *  0b1..Scan is done
 */
#define TSI_DATA_EOSF(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_DATA_EOSF_SHIFT)) & TSI_DATA_EOSF_MASK)

#define TSI_DATA_OVERRUNF_MASK                   (0x20000000U)
#define TSI_DATA_OVERRUNF_SHIFT                  (29U)
/*! OVERRUNF - Overrun Flag
 *  0b0..There is trigger or ips bus writing during scan progress
 *  0b1..There is no trigger or ips bus writing during scan progress
 */
#define TSI_DATA_OVERRUNF(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_DATA_OVERRUNF_SHIFT)) & TSI_DATA_OVERRUNF_MASK)

#define TSI_DATA_OUTRGF_MASK                     (0x40000000U)
#define TSI_DATA_OUTRGF_SHIFT                    (30U)
/*! OUTRGF - Out of Range Flag
 *  0b0..The counter value is not out of range
 *  0b1..The counter value is out of range
 */
#define TSI_DATA_OUTRGF(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_DATA_OUTRGF_SHIFT)) & TSI_DATA_OUTRGF_MASK)

#define TSI_DATA_DPD_OUTRGF_MASK                 (0x80000000U)
#define TSI_DATA_DPD_OUTRGF_SHIFT                (31U)
/*! DPD_OUTRGF - DPD Out of Range Flag
 *  0b0..The counter value is not out of range
 *  0b1..The counter value is out of range
 */
#define TSI_DATA_DPD_OUTRGF(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_DATA_DPD_OUTRGF_SHIFT)) & TSI_DATA_DPD_OUTRGF_MASK)
/*! @} */

/*! @name MISC - TSI Miscellaneous Register */
/*! @{ */

#define TSI_MISC_CAP_BANK_2500FF_MASK            (0x7U)
#define TSI_MISC_CAP_BANK_2500FF_SHIFT           (0U)
/*! CAP_BANK_2500FF - Enable the 2500fF caps inside cap bank
 *  0b000..Enable another 2.5 pF in cap bank
 *  0b001..Enable another 5.0 pF in cap bank
 *  0b010..Enable another 7.5 pF in cap bank
 *  0b011..Enable another 10 pF in cap bank
 *  0b100..Enable another 12.5 pF in cap bank
 *  0b101..Enable another 15 pF in cap bank
 *  0b110..Enable another 17.5 pF in cap bank
 *  0b111..Enable another 20 pF in cap bank
 */
#define TSI_MISC_CAP_BANK_2500FF(x)              (((uint32_t)(((uint32_t)(x)) << TSI_MISC_CAP_BANK_2500FF_SHIFT)) & TSI_MISC_CAP_BANK_2500FF_MASK)

#define TSI_MISC_CAP_BANK_312FF_MASK             (0x70U)
#define TSI_MISC_CAP_BANK_312FF_SHIFT            (4U)
/*! CAP_BANK_312FF - Enable the 312fF caps inside cap bank
 *  0b000..Enable another 0.3125 pF
 *  0b001..Enable another 0.625 pF
 *  0b010..Enable another 0.936 pF
 *  0b011..Enable another 1.25 pF
 *  0b100..Enable another 1.56 pF
 *  0b101..Enable another 1.87 pF
 *  0b110..Enable another 2.19 pF
 *  0b111..Enable another 2.5 pF
 */
#define TSI_MISC_CAP_BANK_312FF(x)               (((uint32_t)(((uint32_t)(x)) << TSI_MISC_CAP_BANK_312FF_SHIFT)) & TSI_MISC_CAP_BANK_312FF_MASK)

