zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_TSI.h
#define TSI_MISC_DPD_MODE_ENABLE_MASK            (0x80000U)
#define TSI_MISC_DPD_MODE_ENABLE_SHIFT           (19U)
/*! DPD_MODE_ENABLE - DPD_MODE_ENABLE
 *  0b0..Configuration information in 3v domain logic is latched
 *  0b1..Configuration information in 3v domain logic is updating from configuration registers simultaneously
 */
#define TSI_MISC_DPD_MODE_ENABLE(x)              (((uint32_t)(((uint32_t)(x)) << TSI_MISC_DPD_MODE_ENABLE_SHIFT)) & TSI_MISC_DPD_MODE_ENABLE_MASK)

#define TSI_MISC_CAP_BANK_148FF_MASK             (0x700000U)
#define TSI_MISC_CAP_BANK_148FF_SHIFT            (20U)
/*! CAP_BANK_148FF - CAP_BANK_148FF
 *  0b000..Enable another 148 pF in cap bank
 *  0b001..Enable another 296 pF in cap bank
 *  0b010..Enable another 444 pF in cap bank
 *  0b011..Enable another 592 pF in cap bank
 *  0b100..Enable another 740 pF in cap bank
 *  0b101..Enable another 888 pF in cap bank
 *  0b110..Enable another 1036 pF in cap bank
 *  0b111..Enable another 1184 pF in cap bank
 */
#define TSI_MISC_CAP_BANK_148FF(x)               (((uint32_t)(((uint32_t)(x)) << TSI_MISC_CAP_BANK_148FF_SHIFT)) & TSI_MISC_CAP_BANK_148FF_MASK)

#define TSI_MISC_CAP_BANK_EN_MASK                (0x800000U)
#define TSI_MISC_CAP_BANK_EN_SHIFT               (23U)
/*! CAP_BANK_EN - Cap bank function enable signal
 *  0b0..Disable cap bank function
 *  0b1..Enable cap bank function
 */
#define TSI_MISC_CAP_BANK_EN(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_MISC_CAP_BANK_EN_SHIFT)) & TSI_MISC_CAP_BANK_EN_MASK)

#define TSI_MISC_CLK_DIVIDER_MASK                (0x1F000000U)
#define TSI_MISC_CLK_DIVIDER_SHIFT               (24U)
/*! CLK_DIVIDER - TSI Clock Divider */
#define TSI_MISC_CLK_DIVIDER(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_MISC_CLK_DIVIDER_SHIFT)) & TSI_MISC_CLK_DIVIDER_MASK)

#define TSI_MISC_COUNTING_CLK_HIGH_MASK          (0x80000000U)
#define TSI_MISC_COUNTING_CLK_HIGH_SHIFT         (31U)
/*! COUNTING_CLK_HIGH - COUNTING_CLK_HIGH
 *  0b0..Using default process inside SSC
 *  0b1..Follow the counting signal from AIP front end
 */
#define TSI_MISC_COUNTING_CLK_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << TSI_MISC_COUNTING_CLK_HIGH_SHIFT)) & TSI_MISC_COUNTING_CLK_HIGH_MASK)
/*! @} */

/*! @name TRIG - TSI AUTO TRIG Register */
/*! @{ */

#define TSI_TRIG_TRIG_PERIOD_COUNTER_MASK        (0xFFFFFU)
#define TSI_TRIG_TRIG_PERIOD_COUNTER_SHIFT       (0U)
/*! TRIG_PERIOD_COUNTER - TRIG_PERIOD_COUNTER */
#define TSI_TRIG_TRIG_PERIOD_COUNTER(x)          (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_PERIOD_COUNTER_SHIFT)) & TSI_TRIG_TRIG_PERIOD_COUNTER_MASK)

#define TSI_TRIG_TRIG_CLK_DIVIDER_MASK           (0x1F000000U)
#define TSI_TRIG_TRIG_CLK_DIVIDER_SHIFT          (24U)
/*! TRIG_CLK_DIVIDER - TRIG_CLK_DIVIDER
 *  0b00000..No divider
 *  0b00001..Divided by 2
 *  0b00010..Divided by 3
 *  0b00011..Divided by 4
 *  0b00100..Divided by 5
 *  0b00101..Divided by 6
 *  0b00110..Divided by 7
 *  0b00111..Divided by 8
 *  0b01000..Divided by 9
 *  0b01001..Divided by 10
 *  0b01010..Divided by 11
 *  0b01011..Divided by 12
 *  0b01100..Divided by 13
 *  0b01101..Divided by 14
 *  0b01110..Divided by 15
 *  0b01111..Divided by 16
 *  0b10000..Divided by 17
 *  0b10001..Divided by 18
 *  0b10010..Divided by 19
 *  0b10011..Divided by 20
 *  0b10100..Divided by 21
 *  0b10101..Divided by 22
 *  0b10110..Divided by 23
 *  0b10111..Divided by 24
 *  0b11000..Divided by 25
 *  0b11001..Divided by 26
 *  0b11010..Divided by 27
 *  0b11011..Divided by 28
 *  0b11100..Divided by 29
 *  0b11101..Divided by 30
 *  0b11110..Divided by 31
 *  0b11111..Divided by 32
 */
#define TSI_TRIG_TRIG_CLK_DIVIDER(x)             (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_CLK_DIVIDER_SHIFT)) & TSI_TRIG_TRIG_CLK_DIVIDER_MASK)

#define TSI_TRIG_TRIG_EN_MASK                    (0x40000000U)
#define TSI_TRIG_TRIG_EN_SHIFT                   (30U)
/*! TRIG_EN - TRIG_EN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TSI_TRIG_TRIG_EN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_EN_SHIFT)) & TSI_TRIG_TRIG_EN_MASK)

#define TSI_TRIG_TRIG_CLK_SEL_MASK               (0x80000000U)
#define TSI_TRIG_TRIG_CLK_SEL_SHIFT              (31U)
/*! TRIG_CLK_SEL - TRIG_CLK_SEL
 *  0b0..32 KHz clock
 *  0b1..clksoc
 */
#define TSI_TRIG_TRIG_CLK_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_CLK_SEL_SHIFT)) & TSI_TRIG_TRIG_CLK_SEL_MASK)
/*! @} */

/*! @name TEST - TSI TEST Register */
/*! @{ */

#define TSI_TEST_TSI_TEST_EN_MASK                (0x1U)
#define TSI_TEST_TSI_TEST_EN_SHIFT               (0U)
/*! TSI_TEST_EN - TSI_TEST_EN
 *  0b0..Test mode is disabled
 *  0b1..Test mode is enabled
 */
#define TSI_TEST_TSI_TEST_EN(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_TEST_TSI_TEST_EN_SHIFT)) & TSI_TEST_TSI_TEST_EN_MASK)

#define TSI_TEST_DPD_TEST_EN_MASK                (0x2U)
#define TSI_TEST_DPD_TEST_EN_SHIFT               (1U)
/*! DPD_TEST_EN - DPD_TEST_EN
 *  0b0..IP is not entering dpd test mode
 *  0b1..IP is entering dpd test mode
 */
#define TSI_TEST_DPD_TEST_EN(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_TEST_DPD_TEST_EN_SHIFT)) & TSI_TEST_DPD_TEST_EN_MASK)

#define TSI_TEST_DPD_TEST_EOSF_MASK              (0x100U)
#define TSI_TEST_DPD_TEST_EOSF_SHIFT             (8U)
/*! DPD_TEST_EOSF - End of Scan Flag in DPD test mode
 *  0b0..Scan is not done in DPD test mode
 *  0b1..Scan is done in DPD test mode
 */
#define TSI_TEST_DPD_TEST_EOSF(x)                (((uint32_t)(((uint32_t)(x)) << TSI_TEST_DPD_TEST_EOSF_SHIFT)) & TSI_TEST_DPD_TEST_EOSF_MASK)

#define TSI_TEST_TSI_ANA_TEST_SETTING_MASK       (0xF0000U)
#define TSI_TEST_TSI_ANA_TEST_SETTING_SHIFT      (16U)
/*! TSI_ANA_TEST_SETTING - TSI_ANA_TEST_SETTING
 *  0b0000..Normal operation mode
 *  0b0001..Test mode 1, Vref test
 *  0b0010..Test mode 2, Vprechrg voltage test
 *  0b0011..Test mode 3, Comparator test
 *  0b0100..Test mode 4, Precharge function test
 *  0b0101..Test mode 5, 4uA bias test
 *  0b0110..Test mode 6, 2uA bias test
 *  0b0111..Test mode 7, Function monitor test
 *  0b1000..Reserved
 *  0b1001..Reserved
 *  0b1010..Reserved
 *  0b1011..Reserved
 *  0b1100..Reserved
 *  0b1101..Reserved
 *  0b1110..Reserved
 *  0b1111..Reserved
 */
#define TSI_TEST_TSI_ANA_TEST_SETTING(x)         (((uint32_t)(((uint32_t)(x)) << TSI_TEST_TSI_ANA_TEST_SETTING_SHIFT)) & TSI_TEST_TSI_ANA_TEST_SETTING_MASK)

#define TSI_TEST_CLKSOC_SEL_MASK                 (0x100000U)
#define TSI_TEST_CLKSOC_SEL_SHIFT                (20U)
/*! CLKSOC_SEL - CLKSOC_SEL
 *  0b0..Reserved
 *  0b1..Reserved
 */
#define TSI_TEST_CLKSOC_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_TEST_CLKSOC_SEL_SHIFT)) & TSI_TEST_CLKSOC_SEL_MASK)

#define TSI_TEST_RUN_CTRL_MASK                   (0x200000U)
#define TSI_TEST_RUN_CTRL_SHIFT                  (21U)
/*! RUN_CTRL - RUN_CTRL
 *  0b0..Gate analog switch clock
 *  0b1..Not gate analog switch clock
 */
#define TSI_TEST_RUN_CTRL(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_TEST_RUN_CTRL_SHIFT)) & TSI_TEST_RUN_CTRL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group TSI_Register_Masks */


/*!
 * @}
 */ /* end of group TSI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_TSI_H_ */

